samples/qes-cases/HBA-gueltig-bis-24.4.2021/normal/OhneRevocationInfo/85d581e4-0153-4899-9bfa-f78d36ad8d82_S_RISEG_RKONN_4.8.1_3.0.7_V_KOCOC_kocobox_3.6.0_2.3.24_req.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:m1="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:m2="urn:oasis:names:tc:dss:1.0:core:schema" xmlns:m3="http://www.w3.org/2000/09/xmldsig#" xmlns:m4="urn:oasis:names:tc:dss-x:1.0:profiles:verificationreport:schema#">
  <SOAP-ENV:Body>
    <m:VerifyDocument xmlns:m="http://ws.gematik.de/conn/SignatureService/v7.4">
      <m0:Context>
        <m1:MandantId>Mandant1</m1:MandantId>
        <m1:ClientSystemId>ClientID1</m1:ClientSystemId>
        <m1:WorkplaceId>CATS</m1:WorkplaceId>
      </m0:Context>
      <m:TvMode>NONE</m:TvMode>
      <m:OptionalInputs>
        <m:UseVerificationTime>
          <m2:SpecificTime>2021-04-20T13:27:34+02:00</m2:SpecificTime>
        </m:UseVerificationTime>
        <m4:ReturnVerificationReport>
          <m4:IncludeVerifier>true</m4:IncludeVerifier>
          <m4:IncludeCertificateValues>true</m4:IncludeCertificateValues>
          <m4:IncludeRevocationValues>true</m4:IncludeRevocationValues>
          <m4:ExpandBinaryValues>false</m4:ExpandBinaryValues>
        </m4:ReturnVerificationReport>
      </m:OptionalInputs>
      <m2:SignatureObject>
        <m2:Base64Signature Type="urn:ietf:rfc:5652">
          MIAGCSqGSIb3DQEHAqCAMIACAQExDzANBglghkgBZQMEAgEFADCABgkqhkiG9w0BBwGggCSABIIg
4DxCdW5kbGUgeG1sbnM9Imh0dHA6Ly9obDcub3JnL2ZoaXIiPg0KICA8IS0tIEJlaXNwaWVsLUJ1
bmRsZSBGcmVpdGV4dHZlcm9yZG51bmcgYWxzIFNwcmVjaHN0dW5kZW5iZWRhcmYgLS0+DQogIDxp
ZCB2YWx1ZT0iODVkNTgxZTQtMDE1My00ODk5LTliZmEtZjc4ZDM2YWQ4ZDgyIiAvPg0KICA8bWV0
YT4NCiAgICA8bGFzdFVwZGF0ZWQgdmFsdWU9IjIwMjAtMDUtMDRUMDg6MzA6MDBaIiAvPg0KICAg
IDxwcm9maWxlIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24v
S0JWX1BSX0VSUF9CdW5kbGV8MS4wLjEiIC8+DQogIDwvbWV0YT4NCiAgPGlkZW50aWZpZXI+DQog
ICAgPHN5c3RlbSB2YWx1ZT0iaHR0cHM6Ly9nZW1hdGlrLmRlL2ZoaXIvTmFtaW5nU3lzdGVtL1By
ZXNjcmlwdGlvbklEIiAvPg0KICAgIDx2YWx1ZSB2YWx1ZT0iMTYwLjEyMy40NTYuNzg5LjEyMy41
OCIgLz4NCiAgPC9pZGVudGlmaWVyPg0KICA8dHlwZSB2YWx1ZT0iZG9jdW1lbnQiIC8+DQogIDx0
aW1lc3RhbXAgdmFsdWU9IjIwMjAtMDUtMDRUMDg6MzA6MDBaIiAvPg0KICA8ZW50cnk+DQogICAg
PGZ1bGxVcmwgdmFsdWU9Imh0dHA6Ly9wdnMucHJheGlzLXRvcHAtZ2x1ZWNrbGljaC5sb2NhbC9m
aGlyL0NvbXBvc2l0aW9uL2Y5NjVjYjcxLWIzZTktNGFiNi05MjA5LTMzM2YzOWRhM2IyMCIgLz4N
CiAgICA8cmVzb3VyY2U+DQogICAgICA8Q29tcG9zaXRpb24geG1sbnM9Imh0dHA6Ly9obDcub3Jn
L2ZoaXIiPg0KICAgICAgICA8aWQgdmFsdWU9ImY5NjVjYjcxLWIzZTktNGFiNi05MjA5LTMzM2Yz
OWRhM2IyMCIgLz4NCiAgICAgICAgPG1ldGE+DQogICAgICAgICAgPHByb2ZpbGUgdmFsdWU9Imh0
dHBzOi8vZmhpci5rYnYuZGUvU3RydWN0dXJlRGVmaW5pdGlvbi9LQlZfUFJfRVJQX0NvbXBvc2l0
aW9ufDEuMC4xIiAvPg0KICAgICAgICA8L21ldGE+DQogICAgICAgIDxzdGF0dXMgdmFsdWU9ImZp
bmFsIiAvPg0KICAgICAgICA8dHlwZT4NCiAgICAgICAgICA8Y29kaW5nPg0KICAgICAgICAgICAg
PHN5c3RlbSB2YWx1ZT0iaHR0cHM6Ly9maGlyLmtidi5kZS9Db2RlU3lzdGVtL0tCVl9DU19TRkhJ
Ul9LQlZfRk9STVVMQVJfQVJUIiAvPg0KICAgICAgICAgICAgPGNvZGUgdmFsdWU9ImUxNkEiIC8+
DQogICAgICAgICAgPC9jb2Rpbmc+DQogICAgICAgIDwvdHlwZT4NCiAgICAgICAgPGRhdGUgdmFs
dWU9IjIwMjAtMDUtMDRUMDg6MDA6MDBaIiAvPg0KICAgICAgICA8YXV0aG9yPg0KICAgICAgICAg
IDxyZWZlcmVuY2UgdmFsdWU9IlByYWN0aXRpb25lci8yMDU5N2UwZS1jYjJhLTQ1YjMtOTVmMC1k
YzNkYmRiNjE3YzMiIC8+DQogICAgICAgICAgPHR5cGUgdmFsdWU9IlByYWN0aXRpb25lciIgLz4N
CiAgICAgICAgPC9hdXRob3I+DQogICAgICAgIDxhdXRob3I+DQogICAgICAgICAgPHR5cGUgdmFs
dWU9IkRldmljZSIgLz4NCiAgICAgICAgICA8aWRlbnRpZmllcj4NCiAgICAgICAgICAgIDxzeXN0
ZW0gdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvTmFtaW5nU3lzdGVtL0tCVl9OU19GT1JfUHJ1
ZWZudW1tZXIiIC8+DQogICAgICAgICAgICA8dmFsdWUgdmFsdWU9IlkvNDAwLzE5MTAvMzYvMzQ2
IiAvPg0KICAgICAgICAgIDwvaWRlbnRpZmllcj4NCiAgICAgICAgPC9hdXRob3I+DQogICAgICAg
IDx0aXRsZSB2YWx1ZT0iZWxla3Ryb25pc2NoZSBBcnpuZWltaXR0ZWx2ZXJvcmRudW5nIiAvPg0K
ICAgICAgICA8Y3VzdG9kaWFuPg0KICAgICAgICAgIDxyZWZlcmVuY2UgdmFsdWU9Ik9yZ2FuaXph
dGlvbi9jZjA0MmU0NC0wODZhLTRkNTEtOWM3Ny0xNzJmOWE5NzJlM2IiIC8+DQogICAgICAgIDwv
Y3VzdG9kaWFuPg0KICAgICAgICA8c2VjdGlvbj4NCiAgICAgICAgICA8Y29kZT4NCiAgICAgICAg
ICAgIDxjb2Rpbmc+DQogICAgICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHBzOi8vZmhpci5r
YnYuZGUvQ29kZVN5c3RlbS9LQlZfQ1NfRVJQX1NlY3Rpb25fVHlwZSIgLz4NCiAgICAgICAgICAg
ICAgPGNvZGUgdmFsdWU9IlByYWN0aWNlU3VwcGx5IiAvPg0KICAgICAgICAgICAgPC9jb2Rpbmc+
DQogICAgICAgICAgPC9jb2RlPg0KICAgICAgICAgIDxlbnRyeT4NCiAgICAgICAgICAgIDwhLS0g
UmVmZXJlbnogYXVmIFZlcm9yZG51bmcgKFN1cHBseVJlcXVlc3QpIC0tPg0KICAgICAgICAgICAg
PHJlZmVyZW5jZSB2YWx1ZT0iU3VwcGx5UmVxdWVzdC8zZGQ1NGI3OC02NWUyLTRhYzItOGU2NS02
NmI3NjlhZDFkOTUiIC8+DQogICAgICAgICAgPC9lbnRyeT4NCiAgICAgICAgPC9zZWN0aW9uPg0K
ICAgICAgPC9Db21wb3NpdGlvbj4NCiAgICA8L3Jlc291cmNlPg0KICA8L2VudHJ5Pg0KICA8ZW50
cnk+DQogICAgPGZ1bGxVcmwgdmFsdWU9Imh0dHA6Ly9wdnMucHJheGlzLXRvcHAtZ2x1ZWNrbGlj
aC5sb2NhbC9maGlyL1N1cHBseVJlcXVlc3QvM2RkNTRiNzgtNjVlMi00YWMyLThlNjUtNjZiNzY5
YWQxZDk1IiAvPg0KICAgIDxyZXNvdXJjZT4NCiAgICAgIDxTdXBwbHlSZXF1ZXN0IHhtbG5zPSJo
dHRwOi8vaGw3Lm9yZy9maGlyIj4NCiAgICAgICAgPGlkIHZhbHVlPSIzZGQ1NGI3OC02NWUyLTRh
YzItOGU2NS02NmI3NjlhZDFkOTUiIC8+DQogICAgICAgIDxtZXRhPg0KICAgICAgICAgIDxwcm9m
aWxlIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24vS0JWX1BS
X0VSUF9QcmFjdGljZVN1cHBseXwxLjAuMSIgLz4NCiAgICAgICAgPC9tZXRhPg0KICAgICAgICA8
ZXh0ZW5zaW9uIHVybD0iaHR0cHM6Ly9maGlyLmtidi5kZS9TdHJ1Y3R1cmVEZWZpbml0aW9uL0tC
Vl9FWF9FUlBfUHJhY3RpY2VTdXBwbHlfUGF5b3IiPg0KICAgICAgICAgIDxleHRlbnNpb24gdXJs
PSJpayI+DQogICAgICAgICAgICA8dmFsdWVJZGVudGlmaWVyPg0KICAgICAgICAgICAgICA8c3lz
dGVtIHZhbHVlPSJodHRwOi8vZmhpci5kZS9OYW1pbmdTeXN0ZW0vYXJnZS1pay9pa25yIiAvPg0K
ICAgICAgICAgICAgICA8dmFsdWUgdmFsdWU9IjEyMzQ1Njc4OSIgLz4NCiAgICAgICAgICAgIDwv
dmFsdWVJZGVudGlmaWVyPg0KICAgICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICAgIDxleHRl
bnNpb24gdXJsPSJuYW1lIj4NCiAgICAgICAgICAgIDx2YWx1ZVN0cmluZyB2YWx1ZT0iRHVtbXkt
S29zdGVudHLEgsKkZ2VyIiAvPg0KICAgICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICAgIDxl
eHRlbnNpb24gdXJsPSJrb3N0ZW50cmFlZ2VydHlwIj4NCiAgICAgICAgICAgIDx2YWx1ZUNvZGlu
Zz4NCiAgICAgICAgICAgICAgPHN5c3RlbSB2YWx1ZT0iaHR0cDovL2ZoaXIuZGUvQ29kZVN5c3Rl
bS92ZXJzaWNoZXJ1bmdzYXJ0LWRlLWJhc2lzIiAvPg0KICAgICAgICAgICAgICA8Y29kZSB2YWx1
ZT0iR0tWIiAvPg0KICAgICAgICAgICAgPC92YWx1ZUNvZGluZz4NCiAgICAgICAgICA8L2V4dGVu
c2lvbj4NCiAgICAgICAgPC9leHRlbnNpb24+DQogICAgICAgIDxpdGVtUmVmZXJlbmNlPg0KICAg
ICAgICAgIDxyZWZlcmVuY2UgdmFsdWU9Ik1lZGljYXRpb24vYTA1NTNhZDUtNTZiYy00NDZjLTkx
ZGUtNzBmMDI2MGI0ZTdhIiAvPg0KICAgICAgICA8L2l0ZW1SZWZlcmVuY2U+DQogICAgICAgIDxx
dWFudGl0eT4NCiAgICAgICAgICA8dmFsdWUgdmFsdWU9IjEiIC8+DQogICAgICAgICAgPHN5c3Rl
bSB2YWx1ZT0iaHR0cDovL3VuaXRzb2ZtZWFzdXJlLm9yZyIgLz4NCiAgICAgICAgICA8Y29kZSB2
YWx1ZT0ie1BhY2thZ2V9IiAvPg0KICAgICAgICA8L3F1YW50aXR5Pg0KICAgICAgICA8YXV0aG9y
ZWRPbiB2YWx1ZT0iMjAyMC0wMi0yMCIgLz4NCiAgICAgICAgPHJlcXVlc3Rlcj4NCiAgICAgICAg
ICA8cmVmZXJlbmNlIHZhbHVlPSJQcmFjdGl0aW9uZXIvMjA1OTdlMGUtY2IyYS00NWIzLTk1ZjAt
ZGMzZGJkYjYxN2MzIiAvPg0KICAgICAgICA8L3JlcXVlc3Rlcj4NCiAgICAgIDwvU3VwcGx5UmVx
dWVzdD4NCiAgICA8L3Jlc291cmNlPg0KICA8L2VudHJ5Pg0KICA8ZW50cnk+DQogICAgPGZ1bGxV
cmwgdmFsdWU9Imh0dHA6Ly9wdnMucHJheGlzLXRvcHAtZ2x1ZWNrbGljaC5sb2NhbC9maGlyL01l
ZGljYXRpb24vYTA1NTNhZDUtNTZiYy00NDZjLTkxZGUtNzBmMDI2MGI0ZTdhIiAvPg0KICAgIDxy
ZXNvdXJjZT4NCiAgICAgIDxNZWRpY2F0aW9uIHhtbG5zPSJodHRwOi8vaGw3Lm9yZy9maGlyIj4N
CiAgICAgICAgPGlkIHZhbHVlPSJhMDU1M2FkNS01NmJjLTQ0NmMtOTFkZS03MGYwMjYwYjRlN2Ei
IC8+DQogICAgICAgIDxtZXRhPg0KICAgICAgICAgIDxwcm9maWxlIHZhbHVlPSJodHRwczovL2Zo
aXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24vS0JWX1BSX0VSUF9NZWRpY2F0aW9uX0ZyZWVU
ZXh0fDEuMC4xIiAvPg0KICAgICAgICA8L21ldGE+DQogICAgICAgIDxleHRlbnNpb24gdXJsPSJo
dHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24vS0JWX0VYX0VSUF9NZWRpY2F0
aW9uX0NhdGVnb3J5Ij4NCiAgICAgICAgICA8dmFsdWVDb2Rpbmc+DQogICAgICAgICAgICA8c3lz
dGVtIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRlL0NvZGVTeXN0ZW0vS0JWX0NTX0VSUF9NZWRp
Y2F0aW9uX0NhdGVnb3J5IiAvPg0KICAgICAgICAgICAgPGNvZGUgdmFsdWU9IjAwIiAvPg0KICAg
ICAgICAgIDwvdmFsdWVDb2Rpbmc+DQogICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICA8ZXh0
ZW5zaW9uIHVybD0iaHR0cHM6Ly9maGlyLmtidi5kZS9TdHJ1Y3R1cmVEZWZpbml0aW9uL0tCVl9F
WF9FUlBfTWVkaWNhdGlvbl9WYWNjaW5lIj4NCiAgICAgICAgICA8dmFsdWVCb29sZWFuIHZhbHVl
PSJ0cnVlIiAvPg0KICAgICAgICA8L2V4dGVuc2lvbj4NCiAgICAgICAgPGNvZGU+DQogICAgICAg
ICAgPGNvZGluZz4NCiAgICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYu
ZGUvQ29kZVN5c3RlbS9LQlZfQ1NfRVJQX01lZGljYXRpb25fVHlwZSIgLz4NCiAgICAgICAgICAg
IDxjb2RlIHZhbHVlPSJmcmVpdGV4dCIgLz4NCiAgICAgICAgICA8L2NvZGluZz4NCiAgICAgICAg
ICA8dGV4dCB2YWx1ZT0iRHVtbXktSW1wZnN0b2ZmIGFscyBGcmVpdGV4dCIgLz4NCiAgICAgICAg
PC9jb2RlPg0KICAgICAgPC9NZWRpY2F0aW9uPg0KICAgIDwvcmVzb3VyY2U+DQogIDwvZW50cnk+
DQogIDxlbnRyeT4NCiAgICA8ZnVsbFVybCB2YWx1ZT0iaHR0cDovL3B2cy5wcmF4aXMtdG9wcC1n
bHVlY2tsaWNoLmxvY2FsL2ZoaXIvUHJhY3RpdGlvbmVyLzIwNTk3ZTBlLWNiMmEtNDViMy05NWYw
LWRjM2RiZGI2MTdjMyIgLz4NCiAgICA8cmVzb3VyY2U+DQogICAgICA8UHJhY3RpdGlvbmVyIHht
bG5zPSJodHRwOi8vaGw3Lm9yZy9maGlyIj4NCiAgICAgICAgPGlkIHZhbHVlPSIyMDU5N2UwZS1j
YjJhLTQ1YjMtOTVmMC1kYzNkYmRiNjE3YzMiIC8+DQogICAgICAgIDxtZXRhPg0KICAgICAgICAg
IDxwcm9maWxlIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24v
S0JWX1BSX0ZPUl9QcmFjdGl0aW9uZXJ8MS4wLjMiIC8+DQogICAgICAgIDwvbWV0YT4NCiAgICAg
ICAgPGlkZW50aWZpZXI+DQogICAgICAgICAgPHR5cGU+DQogICAgICAgICAgICA8Y29kaW5nPg0K
ICAgICAgICAgICAgICA8c3lzdGVtIHZhbHVlPSJodHRwOi8vdGVybWlub2xvZ3kuaGw3Lm9yZy9D
b2RlU3lzdGVtL3YyLTAyMDMiIC8+DQogICAgICAgICAgICAgIDxjb2RlIHZhbHVlPSJMQU5SIiAv
Pg0KICAgICAgICAgICAgPC9jb2Rpbmc+DQogICAgICAgICAgPC90eXBlPg0KICAgICAgICAgIDxz
eXN0ZW0gdmFsdWU9Imh0dHBzOi8vZmhpci5rYnYuZGUvTmFtaW5nU3lzdGVtL0tCVl9OU19CYXNl
X0FOUiIgLz4NCiAgICAgICAgICA8dmFsdWUgdmFsdWU9IjgzODM4MjIwMiIgLz4NCiAgICAgICAg
PC9pZGVudGlmaWVyPg0KICAgICAgICA8bmFtZT4NCiAgICAgICAgICA8dXNlIHZhbHVlPSJvZmZp
Y2lhbCIgLz4NCiAgICAgICAgICA8ZmFtaWx5IHZhbHVlPSJUb3BwLUdsw7xja2xpY2giPg0KICAg
ICAgICAgICAgPGV4dGVuc2lvbiB1cmw9Imh0dHA6Ly9obDcub3JnL2ZoaXIvU3RydWN0dXJlRGVm
aW5pdGlvbi9odW1hbm5hbWUtb3duLW5hbWUiPg0KICAgICAgICAgICAgICA8dmFsdWVTdHJpbmcg
dmFsdWU9IlRvcHAtR2zDvGNrbGljaCIgLz4NCiAgICAgICAgICAgIDwvZXh0ZW5zaW9uPg0KICAg
ICAgICAgIDwvZmFtaWx5Pg0KICAgICAgICAgIDxnaXZlbiB2YWx1ZT0iSGFucyIgLz4NCiAgICAg
ICAgICA8cHJlZml4IHZhbHVlPSJEci4gbWVkLiI+DQogICAgICAgICAgICA8ZXh0ZW5zaW9uIHVy
bD0iaHR0cDovL2hsNy5vcmcvZmhpci9TdHJ1Y3R1cmVEZWZpbml0aW9uL2lzbzIxMDkwLUVOLXF1
YWxpZmllciI+DQogICAgICAgICAgICAgIDx2YWx1ZUNvZGUgdmFsdWU9IkFDIiAvPg0KICAgICAg
ICAgICAgPC9leHRlbnNpb24+DQogICAgICAgICAgPC9wcmVmaXg+DQogICAgICAgIDwvbmFtZT4N
CiAgICAgICAgPHF1YWxpZmljYXRpb24+DQogICAgICAgICAgPGNvZGU+DQogICAgICAgICAgICA8
Y29kaW5nPg0KICAgICAgICAgICAgICA8c3lzdGVtIHZhbHVlPSJodHRwczovL2ZoaXIua2J2LmRl
L0NvZGVTeXN0ZW0vS0JWX0NTX0ZPUl9RdWFsaWZpY2F0aW9uX1R5cGUiIC8+DQogICAgICAgICAg
ICAgIDxjb2RlIHZhbHVlPSIwMCIgLz4NCiAgICAgICAgICAgIDwvY29kaW5nPg0KICAgICAgICAg
IDwvY29kZT4NCiAgICAgICAgPC9xdWFsaWZpY2F0aW9uPg0KICAgICAgICA8cXVhbGlmaWNhdGlv
bj4NCiAgICAgICAgICA8Y29kZT4NCiAgICAgICAgICAgIDx0ZXh0IHZhbHVlPSJIYXVzYXJ6dCIg
Lz4NCiAgICAgICAgICA8L2NvZGU+DQogICAgICAgIDwvcXVhbGlmaWNhdGlvbj4NCiAgICAgIDwv
UHJhY3RpdGlvbmVyPg0KICAgIDwvcmVzb3VyY2U+DQogIDwvZW50cnk+DQogIDxlbnRyeT4NCiAg
ICA8ZnVsbFVybCB2YWx1ZT0iaHR0cDovL3B2cy5wcmF4aXMtdG9wcC1nbHVlY2tsaWNoLmxvY2Fs
L2ZoaXIvT3JnYW5pemF0aW9uL2NmMDQyZTQ0LTA4NmEtNGQ1MS05Yzc3LTE3MmY5YTk3MmUzYiIg
Lz4NCiAgICA8cmVzb3VyY2U+DQogICAgICA8T3JnYW5pemF0aW9uIHhtbG5zPSJodHRwOi8vaGw3
Lm9yZy9maGlyIj4NCiAgICAgICAgPGlkIHZhbHVlPSJjZjA0MmU0NC0wODZhLTRkNTEtOWM3Ny0x
NzJmOWE5NzJlM2IiIC8+DQogICAgICAgIDxtZXRhPg0KICAgICAgICAgIDxwcm9maWxlIHZhbHVl
PSJodHRwczovL2ZoaXIua2J2LmRlL1N0cnVjdHVyZURlZmluaXRpb24vS0JWX1BSX0ZPUl9Pcmdh
bml6YXRpb258MS4wLjMiIC8+DQogICAgICAgIDwvbWV0YT4NCiAgICAgICAgPGlkZW50aWZpZXI+
DQogICAgICAgICAgPHR5cGU+DQogICAgICAgICAgICA8Y29kaW5nPg0KICAgICAgICAgICAgICA8
c3lzdGVtIHZhbHVlPSJodHRwOi8vdGVybWlub2xvZ3kuaGw3Lm9yZy9Db2RlU3lzdGVtL3YyLTAy
MDMiIC8+DQogICAgICAgICAgICAgIDxjb2RlIHZhbHVlPSJCU05SIiAvPg0KICAgICAgICAgICAg
PC9jb2Rpbmc+DQogICAgICAgICAgPC90eXBlPg0KICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9Imh0
dHBzOi8vZmhpci5rYnYuZGUvTmFtaW5nU3lzdGVtL0tCVl9OU19CYXNlX0JTTlIiIC8+DQogICAg
ICAgICAgPHZhbHVlIHZhbHVlPSIwMzEyMzQ1NjciIC8+DQogICAgICAgIDwvaWRlbnRpZmllcj4N
CiAgICAgICAgPG5hbWUgdmFsdWU9IkhhdXNhcnp0cHJheGlzIERyLiBUb3BwLUdsw7xja2xpY2gi
IC8+DQogICAgICAgIDx0ZWxlY29tPg0KICAgICAgICAgIDxzeXN0ZW0gdmFsdWU9InBob25lIiAv
Pg0KICAgICAgICAgIDx2YWx1ZSB2YWx1ZT0iMDMwMTIzNDU2NyIgLz4NCiAgICAgICAgPC90ZWxl
Y29tPg0KICAgICAgICA8YWRkcmVzcz4NCiAgICAgICAgICA8dHlwZSB2YWx1ZT0iYm90aCIgLz4N
CiAgICAgICAgICA8bGluZSB2YWx1ZT0iTXVzdGVyc3RyLiAyIj4NCiAgICAgICAgICAgIDxleHRl
bnNpb24gdXJsPSJodHRwOi8vaGw3Lm9yZy9maGlyL1N0cnVjdHVyZURlZmluaXRpb24vaXNvMjEw
OTAtQURYUC1ob3VzZU51bWJlciI+DQogICAgICAgICAgICAgIDx2YWx1ZVN0cmluZyB2YWx1ZT0i
MiIgLz4NCiAgICAgICAgICAgIDwvZXh0ZW5zaW9uPg0KICAgICAgICAgICAgPGV4dGVuc2lvbiB1
cmw9Imh0dHA6Ly9obDcub3JnL2ZoaXIvU3RydWN0dXJlRGVmaW5pdGlvbi9pc28yMTA5MC1BRFhQ
LXN0cmVldE5hbWUiPg0KICAgICAgICAgICAgICA8dmFsdWVTdHJpbmcgdmFsdWU9Ik11c3RlcnN0
ci4iIC8+DQogICAgICAgICAgICA8L2V4dGVuc2lvbj4NCiAgICAgICAgICA8L2xpbmU+DQogICAg
ICAgICAgPGNpdHkgdmFsdWU9IkJlcmxpbiIgLz4NCiAgICAgICAgICA8cG9zdGFsQ29kZSB2YWx1
ZT0iMTA2MjMiIC8+DQogICAgICAgIDwvYWRkcmVzcz4NCiAgICAgIDwvT3JnYW5pemF0aW9uPg0K
ICAgIDwvcmVzb3VyY2U+DQogIDwvZW50cnk+DQo8L0J1bmRsZT4AAAAAAACggDCCBOEwggPJoAMC
AQICBin5EldKczANBgkqhkiG9w0BAQsFADBQMQswCQYDVQQGEwJERTEfMB0GA1UECgwWZ2VtYXRp
ayBHbWJIIE5PVC1WQUxJRDEgMB4GA1UEAwwXR0VNLkhCQS1xQ0EyNCBURVNULU9OTFkwHhcNMjEw
NDIwMDAwMDAwWhcNMjEwNDI0MjM1OTU5WjB8MQswCQYDVQQGEwJERTFtMBEGA1UEBAwKTmlnZ2Vt
ZXllcjAXBgNVBCoMEEhpbGxhcnkgRnJlaWZyYXUwGwYDVQQFExQ4MDI3Njg4MzExMDAwMDEyOTE4
NDAiBgNVBAMMG0hpbGxhcnkgTmlnZ2VtZXllclRFU1QtT05MWTCCASIwDQYJKoZIhvcNAQEBBQAD
ggEPADCCAQoCggEBAK8p8PJsW14beiRmgIRY1DSqTmR4mHMbrVhR1m6l909L27+z7p7Don8+ObJs
vRL+jYOSnfcmNjY9RhwAbUM/LXyuTAWQV+oH6/ZfgCwxuXn/WoOKHxUr5KJqb3ME58Ji5cAXKF0W
EkRKTt2ENCRRRL2bKHN9naTqyhC7lPjMQA/tQcooXKOT7sS8nsZS2auWmIRkcibGJScoO5p+JG4z
6b4KGUgKuDyEGDt3w3SVKDxOqbSqAlBcb74mOZdBFPq2Vi2p3N1I7B6UZ9qUPxB/mos33rWkyF6X
N6iFvNiA/ADoV+LPNCSEu/x7qu+VjbZlTqm64yL+B69swzL1uKDUSMUCAwEAAaOCAZMwggGPMAwG
A1UdEwEB/wQCMAAwOAYIKwYBBQUHAQEELDAqMCgGCCsGAQUFBzABhhxodHRwOi8vZWhjYS5nZW1h
dGlrLmRlL29jc3AvMBsGCSsGAQQBwG0DBQQOMAwGCisGAQQBwG0DBQEwIgYIKwYBBQUHAQMEFjAU
MAgGBgQAjkYBATAIBgYEAI5GAQQwHwYDVR0jBBgwFoAUZ5wxtunAN+odG4HnpPU7zB4XATkwHQYD
VR0OBBYEFDYH2JC9TzqIzwA9OPbySSRLSx6hMA4GA1UdDwEB/wQEAwIGQDA5BgNVHSAEMjAwMAkG
ByqCFABMBEgwCQYHBACL7EABAjAKBggqghQATASBETAMBgorBgEEAYLNMwEBMHkGBSskCAMDBHAw
bqQoMCYxCzAJBgNVBAYTAkRFMRcwFQYDVQQKDA5nZW1hdGlrIEJlcmxpbjBCMEAwPjA8MA4MDMOE
cnp0aW4vQXJ6dDAJBgcqghQATAQeEx8xLUhCQS1UZXN0a2FydGUtODgzMTEwMDAwMTI5MTg0MA0G
CSqGSIb3DQEBCwUAA4IBAQAzH5B0Bdv6vQRdfEeTEUNPJ5T8MMRNKkrFtVlSaOJSO9LfXmLFoSna
FoUOEGpiPmNCDI2eDxMlVKsmEgoyRVSSUMZs5/NAi3eyBFtqvMPyziAQDb6GKs2T/kUDSiiHrUeD
YYvzWYCchVCFah3LWd/YDFcE96y0SAW61WTpiRGJclFLOqFhpTxGXZKM6ptkjtVsLteONU46luDY
I/a132r+D7EdrcUSFA/zoXpqd/MFTDs8aszNbAdH6pVW2FklRbcWEZTnazmjTnkEf6kpBuBqzLI7
wye1iDn2zLsHfDLKpKuG+z53g5SMzsDs0Nf+bBVq/gUT7QKEir6n6dOilMKaAAAxggORMIIDjQIB
ATBaMFAxCzAJBgNVBAYTAkRFMR8wHQYDVQQKDBZnZW1hdGlrIEdtYkggTk9ULVZBTElEMSAwHgYD
VQQDDBdHRU0uSEJBLXFDQTI0IFRFU1QtT05MWQIGKfkSV0pzMA0GCWCGSAFlAwQCAQUAoIIB0jAY
BgkqhkiG9w0BCQMxCwYJKoZIhvcNAQcBMBwGCSqGSIb3DQEJBTEPFw0yMTA0MjAxMTI3MzNaMCUG
BgQAjUUCATEbDBl0ZXh0L3BsYWluOyBjaGFyc2V0PXV0Zi04MC8GCSqGSIb3DQEJBDEiBCBm0/7Z
WTVzK/5GHx+H2kjzvbFwW4uzMtq2gWgIGwIZkzAwBgsqhkiG9w0BCRACBDEhMB8MEmEgQ01TRG9j
dW1lbnQyc2lnbgYJKoZIhvcNAQcBMGEGCSqGSIb3DQEJNDFUMFIwDQYJYIZIAWUDBAIBBQChQQYJ
KoZIhvcNAQEKMDSgDzANBglghkgBZQMEAgEFAKEcMBoGCSqGSIb3DQEBCDANBglghkgBZQMEAgEF
AKIDAgEgMIGqBgsqhkiG9w0BCRACLzGBmjCBlzCBlDCBkTANBglghkgBZQMEAgEFAAQg+A3rD/jE
h0T/nYMNRcqHC+mKTs0COt6hUzg07nSW4pIwXjBUpFIwUDELMAkGA1UEBhMCREUxHzAdBgNVBAoM
FmdlbWF0aWsgR21iSCBOT1QtVkFMSUQxIDAeBgNVBAMMF0dFTS5IQkEtcUNBMjQgVEVTVC1PTkxZ
AgYp+RJXSnMwQQYJKoZIhvcNAQEKMDSgDzANBglghkgBZQMEAgEFAKEcMBoGCSqGSIb3DQEBCDAN
BglghkgBZQMEAgEFAKIDAgEgBIIBABjMQN0ynCmSBZT2VU6pOeFwGuTWh1lbIGN17MPkWFUuGiYF
jK8uHKNIMf0rHtJ8T28y7ycSQNZ1scb4kRFI6AXcmMX83rIisqE366YcfT/MmOq70YsUzmmmsI6e
lQMwh2D3hETmbwYGT39RSK14bWYlpmtdx9eLQ2CRo8B4x2hAeStpQWMqL7OJNfPK1GDa2nor6svs
dAdA39aon9C8IsCYYGL1j6UpN9wn3rE7XRhqZoaUSNf4FdvRKXcka6ioPGmGgRkt28KzMaUkViKL
3vO8q3CrQ+8g4rm5lngBMRstQEFhkaD8PEChqmNPXsJ/RiyDIW3wkiaUMTC51b5K1VGhAAAAAAAA
AA==

        </m2:Base64Signature>
      </m2:SignatureObject>
      <m:IncludeRevocationInfo>false</m:IncludeRevocationInfo>
    </m:VerifyDocument>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>